swe-modified-2025/openfoam/example_4_1_2d_dam_break/no_slip/dambreak_Ny160/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;

method          simple;

simpleCoeffs
{
    n           (4 1 1);
    delta       0.001;
}

distributed     no;

roots           ();
